### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:
users = (purchase_data)["SN"].unique()



players = [{"Total Players": len(users)}]

df_players = pd.DataFrame(players)
df_players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
u_items = (purchase_data)["Item ID"].unique()
ave_price = (purchase_data)["Price"].sum()/(len(purchase_data["Price"]))
total_purchases = (len(purchase_data["Purchase ID"]))
total_rev = (purchase_data)["Price"].sum()

analysis = [{"Unique Items":len(u_items),"Average Price":ave_price,
             "Total Purchases":total_purchases,"Total Revenue":total_rev}]

analysis_df = pd.DataFrame(analysis)
analysis_df

   Average Price  Total Purchases  Total Revenue  Unique Items
0       3.050987              780        2379.77           183

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [5]:

gender_drop_dupes = purchase_data.drop_duplicates(["SN"])

gen_total_count = gender_drop_dupes["Gender"].value_counts()
gen_percent = (gen_total_count)/(len(users))*100

gen_dems = {"Total Count":gen_total_count, "Percentage of Players":gen_percent}

gen_dems_df = pd.DataFrame(gen_dems)

gen_dems_df

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [6]:
gender_purchase_counts = purchase_data["Gender"].value_counts()

gender_purchase_counts

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [7]:
gender_grouped = purchase_data.groupby(["Gender"])
gen_total_val = gender_grouped["Price"].sum()
gen_total_val

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [8]:
gen_ave_per = gender_grouped["Price"].sum()/gender_purchase_counts

gen_ave_per

Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
dtype: float64

In [9]:
ave_total_per = gender_grouped["Price"].sum()/(gen_total_count)
ave_total_per

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [10]:
gender_purchase_summary = {"Purchase Count":gender_purchase_counts,
                           "Average Purchase Price":gen_ave_per,"Total Purchase Value":gen_total_val,
                           "Avg Total Purchase Per Person":ave_total_per}

gender_summary = pd.DataFrame(gender_purchase_summary)
gender_summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [11]:
age_bins = [0,9,14,19,24,29,34,39,float("inf")]
bin_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]


purchase_data["Age Groups"] = pd.cut(purchase_data["Age"], age_bins, labels=bin_names)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [12]:
age_dem_clean = purchase_data.drop_duplicates(["SN"])
age_total_count = age_dem_clean["Age Groups"].value_counts()
age_total_count

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Groups, dtype: int64

In [13]:
percentage = (age_total_count)/(len(users))*100
percentage

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Groups, dtype: float64

In [14]:
age_dem = {"Total Count":age_total_count,"Percentage of Players":percentage}

age_dem_df = pd.DataFrame(age_dem)

age_dem_df

       Total Count  Percentage of Players
20-24          258              44.791667
15-19          107              18.576389
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
10-14           22               3.819444
<10             17               2.951389
40+             12               2.083333

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [17]:
age_purchase_count = purchase_data["Age Groups"].value_counts()
age_purchase_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: Age Groups, dtype: int64

In [18]:
age_grouped = purchase_data.groupby(["Age Groups"])
age_total_val = age_grouped["Price"].sum()
age_total_val

Age Groups
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [19]:
age_ave_pur = age_grouped["Price"].sum()/age_purchase_count

age_ave_pur

10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
<10      3.353478
dtype: float64

In [20]:
age_total_per = age_grouped["Price"].sum()/(age_total_count)
age_total_per

10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
<10      4.537059
dtype: float64

In [36]:
age_purchase_analysis = {"Purchase Count":age_purchase_count,
                         "Average Purchase Price":age_ave_pur,"Total Purchase Value":age_total_val,
                         "Avg total Purchase per Person":age_total_per}

age_purchase_df = pd.DataFrame(age_purchase_analysis)

age_purchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg total Purchase per Person
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667
<10,23,3.353478,77.13,4.537059

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [30]:
player_purchase_count = purchase_data["SN"].value_counts()



player_grouped = purchase_data.groupby(["SN"])
player_total_pur = player_grouped["Price"].sum()
player_ave_pur = player_grouped["Price"].sum()/player_purchase_count


top_spenders = {"Purchse Count":player_purchase_count,"Average Purchase Price":player_ave_pur,"Total Purchase Value":player_total_pur}

spenders_df = pd.DataFrame(top_spenders)

top_spenders_df = spenders_df.sort_values("Total Purchase Value", ascending=False)

top_spenders_df.head()

             Purchse Count  Average Purchase Price  Total Purchase Value
Lisosia93                5                3.792000                 18.96
Idastidru52              4                3.862500                 15.45
Chamjask73               3                4.610000                 13.83
Iral74                   4                3.405000                 13.62
Iskadarya95              3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [124]:
items_df = purchase_data[["Item ID","Item Name","Price"]]
items_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80